ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l210x/UC4_SPI_1.0.xml
    <register id="UC4_SPI_CTL1" width="32" offset="0x114C" description="SPI control register 1">
        <bitfield id="LBM" description="Loop back mode" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable loopback mode"/>
            <bitenum id="ENABLE" value="0x1" description="Enable loopback mode"/>
        </bitfield>
        <bitfield id="CP" description="Controller or peripheral mode select. This bit can be modified only when SPI is disabled, CTL1.ENABLE=0." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Select Peripheral mode"/>
            <bitenum id="ENABLE" value="0x1" description="Select Controller Mode"/>
        </bitfield>
        <bitfield id="POD" description="Peripheral-mode: Data output disabled
This bit is relevant only in Peripheral mode. In multiple-peripheral system topologies, SPI controller can broadcast a message to all peripherals, while only one peripheral drives the line. 
POD can be used by the SPI peripheral to disable driving data on the line." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPI can drive the POCI output in peripheral mode."/>
            <bitenum id="ENABLE" value="0x1" description="SPI cannot drive the POCI output in peripheral mode."/>
        </bitfield>
        <bitfield id="MSB" description="MSB first select. Controls the direction of the receive and transmit shift register." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="LSB first"/>
            <bitenum id="ENABLE" value="0x1" description="MSB first"/>
        </bitfield>
        <bitfield id="PREN" description="Parity receive enable
If enabled, parity reception check will be done for both controller and peripheral modes
In case of a parity miss-match the parity error flag RIS.PER will be set." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Parity receive function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Parity receive function"/>
        </bitfield>
        <bitfield id="PES" description="Even Parity Select" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Odd Parity mode"/>
            <bitenum id="ENABLE" value="0x1" description="Even Parity mode"/>
        </bitfield>
        <bitfield id="ENABLE" description="SPI enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable module function"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module function"/>
        </bitfield>
        <bitfield id="PTEN" description="Parity transmit enable
If enabled, parity transmission will be done for both controller and peripheral modes." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Parity transmission is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Parity transmission is enabled"/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>

</module>